，是决策树还是回归树，怎么实现的，要讲训练时候的具体过程（我也不懂到底要多具体啊TAT）
kmeans和dbscan的区别
kmeans选初始点有没有什么技巧
knn的原理


Lightgbm和xgboost的区别，生成的树主要是深还是宽
介绍一下狄利克雷分布
两组样本，离散型或者连续型，有什么方法判断他们的相关性？（相关系数、互信息、协方差、假设检验、置信区间）

SQL题：计算点击率
Id, event_type, object_id
1, "view", 200
1, "click" ,200
2, "view", 201

2 如何防止过拟合？L1, L2

3 GBDT原理

4 10亿个QQ号如何把这个账号归属给每个人?
1. 数仓理论，分层，结合业务
2. 星型 雪花模型
3. 事实表怎么建的？周期快照表？对于缓慢维怎么处理的？
4. Hive架构
5. Hive调优
6. MR 过程
7. 一道SQL

####
1. 自我介绍，项目，具体做了什么
2. 简历里具体写了难点，所以也问了如何解决这些难点的。
3. 写一道快排，说一下思路，时间复杂度
4. 什么语言？python装饰器，生成器（不熟）
5. 知道哪些分类器，我说LR，SVM，决策树，他补充贝叶斯分类器。
6. 分类与回归的常见loss写一下
7. 信息熵是什么，公式你知道吗？
8. xgboost的原理，lr和svm的原理和区别
9. bagging和boosting的区别
   答案：https://zhuanlan.zhihu.com/p/65389367
